IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_pie_ctrl_regs.xml
	<register id="PIEIFR3" width="16" page="1" offset="0x7" internal="0" description="Interrupt Group 3 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 3.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 3.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 3.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 3.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 3.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 3.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 3.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 3.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER4" width="16" page="1" offset="0x8" internal="0" description="Interrupt Group 4 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 4.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 4.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 4.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 4.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 4.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 4.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 4.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 4.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR4" width="16" page="1" offset="0x9" internal="0" description="Interrupt Group 4 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 4.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 4.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 4.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 4.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 4.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 4.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 4.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 4.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER5" width="16" page="1" offset="0xa" internal="0" description="Interrupt Group 5 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 5.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 5.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 5.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 5.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 5.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 5.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 5.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 5.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR5" width="16" page="1" offset="0xb" internal="0" description="Interrupt Group 5 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 5.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 5.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 5.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 5.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 5.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 5.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 5.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 5.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER6" width="16" page="1" offset="0xc" internal="0" description="Interrupt Group 6 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 6.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 6.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 6.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 6.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 6.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 6.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 6.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 6.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR6" width="16" page="1" offset="0xd" internal="0" description="Interrupt Group 6 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 6.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 6.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 6.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 6.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 6.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 6.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 6.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 6.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER7" width="16" page="1" offset="0xe" internal="0" description="Interrupt Group 7 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 7.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 7.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 7.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 7.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 7.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 7.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 7.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 7.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR7" width="16" page="1" offset="0xf" internal="0" description="Interrupt Group 7 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 7.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 7.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 7.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 7.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 7.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 7.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 7.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 7.8" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
